<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 日志设置
// +----------------------------------------------------------------------
return [
    // 日志记录方式，内置 file socket 支持扩展
    'type'        => 'File',
    // 日志保存目录
    'path'        => Env::get('runtime_path') . 'log/',
    // 日志记录级别 alert
    'level'       => ['notice','warning','error','web_notice'],
    // 单文件日志写入
    'single'      => false,
    // 独立日志级别
    'apart_level' => ['sql'],
    //单个日志文件的大小限制，超过后会自动记录到第二个文件
    'file_size' =>2097152,
    // 最大日志文件数量
    'max_files'   => 10,
    // 是否关闭日志写入
    'close'       => false,
    //日志的时间格式，默认是` c `
    'time_format' =>'Y-m-d H:i:s',
    // 自定义日志 标识信息
    'web_level'=>'web_notice'
];
